# 1级合成8级宝石 是自己合划算，还是直接买划算

# 合成过程需要消耗 金，钻石，体力

# 规则
# 1.购买1级石，消耗金和钻石
# 2.1-》3，消耗金，体力，1级石
# 3.3-》4，消耗金，体力，1级石，一定概率
# 4.4-》5，消耗金，体力，4级石

'''
    购买1级
'''
l1_buy_gold=0.75
l1_bug_diamond=8

'''
    1合3
'''
l1_to_l3=12
l1_to_l3_gold=0.39
l1_to_l3_vit=10

'''
    3合4
'''
l3_to_l4=16
l3_to_l4_gold=0.39
l3_to_l4_vit=10
l3_to_l4_rate=0.4878 # 成功概率，失败的话，金和石都被扣除，但不扣除体力

'''
    4合6
'''
l4_to_l6=12
l4_to_l6_gold=19.75
l4_to_l6_vit=10

# 一个6级石，750金
# 一个钻石，0.05金
# 一个体力，1金